<a href="https://colab.research.google.com/github/SriKrishna-GH/DS/blob/main/daag.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [14]:
import numpy as np
import pandas as pd
df=pd.DataFrame({"Name":["Alice","Bob","Charlie","Alice","Bob","Charlie"],"Catagory":["A","B","C","A","B","C"],"value":np.random.randint(1,5,size=6),"score":np.random.randint(60,100,size=6)})
print("\n Original DataFrame: \n",df)
df1=df.groupby(["Name"],as_index=False)["value"].sum()
print("\n Grouped by name and aggredation with one column sum:\n",df1)

 Original DataFrame:
       Name Catagory  value  score
0    Alice        A      1     60
1      Bob        B      3     62
2  Charlie        C      3     64
3    Alice        A      2     73
4      Bob        B      3     62
5  Charlie        C      3     96

 Grouped by name and aggredation with one column sum:
       Name  value
0    Alice      3
1      Bob      6
2  Charlie      6

In [15]:
df2=df.groupby(('Name'),as_index=False)[['value','score']].sum()
print("\nGroup by name and Aggregation with two column:\n",df2)

Group by name and Aggregation with two column:
       Name  value  score
0    Alice      3    133
1      Bob      6    124
2  Charlie      6    160

In [16]:
df3=df.groupby(('Name'),as_index=False)['value'].agg('sum')
print("\nGroup by name and Aggregation with one column using agg function:\n",df3)

Group by name and Aggregation with one column using agg function:
       Name  value
0    Alice      3
1      Bob      6
2  Charlie      6

In [17]:
df4 = df.groupby('Name').agg({
'value': ['sum', 'mean', 'min', 'max'],
'score': ['sum', 'mean']})
print("\nGroup by name and multiple Aggregation functions :\n", df4)

Group by name and multiple Aggregation functions :
         value              score
          sum mean min max   sum  mean
Name
Alice       3  1.5   1   2   133  66.5
Bob         6  3.0   3   3   124  62.0
Charlie     6  3.0   3   3   160  80.0

In [18]:
df5=df.groupby(("Name"),as_index=False)["value"].count()
print("\n Group and count:\n",df5)

 Group and count:
       Name  value
0    Alice      2
1      Bob      2
2  Charlie      2

In [19]:
df6=df.groupby(("Name")).count()
print("\n Group and count:\n",df6)

 Group and count:
          Catagory  value  score
Name
Alice           2      2      2
Bob             2      2      2
Charlie         2      2      2

In [20]:
df7=df.groupby(('Name'),as_index=False)['value'].first()
print("\n Group and display from first:\n",df7)

 Group and display from first:
       Name  value
0    Alice      1
1      Bob      3
2  Charlie      3

In [21]:
df8=df.groupby(('Name')).first()
print("\n Group and display from first:\n",df8)

 Group and display from first:
         Catagory  value  score
Name
Alice          A      1     60
Bob            B      3     62
Charlie        C      3     64

In [22]:
df9=df.groupby(("Name")).first()
print("\n Group and display from first\n",df9)

 Group and display from first
         Catagory  value  score
Name
Alice          A      1     60
Bob            B      3     62
Charlie        C      3     64

In [23]:
df9=df.groupby(('Name')).last()
print("\n Group and display from last:\n",df9)

 Group and display from last:
         Catagory  value  score
Name
Alice          A      2     73
Bob            B      3     62
Charlie        C      3     96

In [24]:
df10=df.groupby(('Name'),as_index=False)['value'].last()
print("\n Group and display from last:\n",df10)

 Group and display from last:
       Name  value
0    Alice      2
1      Bob      3
2  Charlie      3

In [25]:
df11=df.groupby(('Name')).size()
print("\n Group and display from size:\n",df11)

 Group and display from size:
 Name
Alice      2
Bob        2
Charlie    2
dtype: int64

In [26]:
 df12=df.groupby(('Name'),as_index=False)['value'].size()
print("\n Group and display from size:\n",df12)

 Group and display from size:
       Name  size
0    Alice     2
1      Bob     2
2  Charlie     2